{
  "X的关联关系": "The association of {model}",
  "模型导入结果提示": "Successfully imported {modelCount} model(s)",
  "确认完成导出提示": "Confirm completion of export?",
  "用户须知": "Notice",
  "导出内容确认": "Confirmation",
  "导出设置": "Settings",
  "开始导出": "Process",
  "开始导入": "Process",
  "删除后，不导出": "Do not export",
  "不在本次导出的模型中": "Not in export list",
  "加选模型": "Add to export list",
  "查看模型": "View model details",
  "模型导出成功！请及时保存并妥善保管。": "Model exported successfully! Please save and keep it in time.",
  "如果页面未出现提示保存窗口，请点击": "If the page does not appear to prompt for a save window, click",
  "重新下载文件": "Re-download",
  "压缩包名": "Package Name",
  "压缩包名仅支持大小写英文字母、数字、- 或 _": "The package name supports only upper and lower case letters, numbers, - or _",
  "文件加密": "Encrypt",
  "密码设置": "Password",
  "长度 6-20 个字符，必须包含英文字母、数字和特殊符号": "Length 6-20 characters, must contain letters, numbers and special symbols",
  "二次确认": "Password Confirm",
  "请输入同样的密码，以确认密码准确": "Please enter the same password to confirm the accuracy of the password",
  "文件有效期": "Valid of Days",
  "永久": "Perm.",
  "一个月": "1 month",
  "请输入密码": "Please enter your password",
  "请输入压缩包名": "Please enter the package name",
  "两次密码输入必须一致": "Both password entries must be the same",
  "文件包上传": "Upload",
  "导入内容确认": "Confirmation",
  "该分组在目标环境中未存在，默认放置于未分类组": "The group does not exist in the target environment, it will placed in Uncategorized group by default",
  "加入未分类分组": "Add to Uncategorized group",
  "新建该分组": "Create this group",
  "模型在目标环境中已存在，不可再导入": "The model already exists in the target environment and cannot be re-imported",
  "冲突": "Conflict",
  "关联类型冲突处理": "Association type conflict handling",
  "覆盖更新": "Overwrite",
  "跳过": "Skip",
  "唯一标志": "ID",
  "关联的模型": "Associated models",
  "模型不存在，无法导入": "Model does not exist and cannot be imported",
  "将文件拖到此处或点击上传": "Drag the file here or click to upload",
  "重新输入密码": "Re-enter password",
  "重新上传": "Re-Upload",
  "仅支持上传来自蓝鲸配置平台专属导出的模型压缩包": "Only .zip file are supported and must conform to the BK-CMDB specification",
  "文件包解密确认": "Package decryption confirmation",
  "文件包密码": "Package Password",
  "请输入上传的文件包密码，完成后点提交验证": "Please enter the password of the uploaded file package, and click Submit to verify when finished",
  "请输入文件包密码": "Please enter the password for the file package",
  "密码输入错误": "Wrong Password",
  "您取消了输入密码": "You canceled entering your password",
  "上传成功": "Upload successful",
  "上传失败": "Upload failed",
  "关系描述": "Association Description",
  "关联对象": "Associated Objects",
  "请选择需要导出的模型": "Please select the model to be exported:",
  "确认取消导出吗": "Confirm cancellation of export?",
  "确认取消导入吗": "Confirm cancellation of import?",
  "原": "Old",
  "新": "New",
  "确认导出": "Confirm export",
  "确认导入": "Confirm import",
  "内置模型不允许导出": "Built-in models are not allowed to be exported",
  "没有选择任何导入模型或模型全部已在目标环境存在": "No imported models are selected or all models already exist in the target environment",
  "模型导入导出用户须知": "1. When the imported model already exists in the target environment (ID), it will be displayed as \"Conflict\" and cannot be imported;\n2. If the exported association type already exists in the target environment (ID), please set overwrite or skip update in the imported process;\n3. If there is sensitive enterprise data (such as employee name, job title, etc.) in the model, please desensitize it before exporting to avoid leaking sensitive information;\n4. When the model group is in import process, it will search for the group name that matches the same ID in the target environment. If it does not exist, you can choose to create a new one or place it in Uncategorized group;\n5. In order to avoid leakage of user information, the exported data will not contain information about the creator or modifier of the data in the local environment;\n6. In order to avoid the conflict of model data being tampered by multiple parties at the same time, only one imported task is allowed to exist at the same time;\n7. Due to the logical protection of the CMDB's own functions, the built-in model of CMDB is not allowed to be imported or exported, please be aware.",
  "当前导入内容没有关联类型": "The current import has no associated type",
  "分组下有模型，不能删除": "There are models under the group that cannot be deleted",
  "已选": "Selected",
  "导入模型": "Import Model"
}